<?

	$cpc_titles=array(
			'виски' => 'images/viski.png',
			'вино' => 'images/back_header.jpg',
            'гравировка' => 'images/ind-gravirovka.png',
            'коньяк' => 'images/konyak.png',
			'именной' => 'images/ind-gravirovka.png',
			'отпроизводителя' => 'images/back_header.png',
	);

	$cpc_names=array(
	'анкерок' => 'анкерок',
	'большуюбочку' => 'большую бочку',
	'бочку' => 'бочку',
	'бочкубезкрана' => 'бочку без крана',
	'бочкувБарнауле' => 'бочку в Барнауле',
	'бочкувБелгороде' => 'бочку в Белгороде',
	'бочкувБрянске' => 'бочку в Брянске',
	'бочкувВолгограде' => 'бочку в Волгограде',
	'бочкувВоронеже' => 'бочку в Воронеже',
	'бочкувЕкатеринбурге' => 'бочку в Екатеринбурге',
	'бочкувИркутске' => 'бочку в Иркутске',
	'бочкувКазани' => 'бочку в Казани',
	'бочкувКирове' => 'бочку в Кирове',
	'бочкувКраснодаре' => 'бочку в Краснодаре',
	'бочкувКраснодарскомкрае' => 'бочку в Краснодарском крае',
	'бочкувКрасноярске' => 'бочку в Красноярске',
	'бочкувКурске' => 'бочку в Курске',
	'бочкувЛипецке' => 'бочку в Липецке',
	'бочкувМоскве' => 'бочку в Москве',
	'бочкувНижнемНовгороде' => 'бочку в Нижнем Новгороде',
	'бочкувНовосибирске' => 'бочку в Новосибирске',
	'бочкувОмске' => 'бочку в Омске',
	'бочкувПензе' => 'бочку в Пензе',
	'бочкувПерми' => 'бочку в Перми',
	'бочкувПетербурге' => 'бочку в Петербурге',
	'бочкувподарок' => 'бочку в подарок',
	'бочкувРостове' => 'бочку в Ростове',
	'бочкувРостовеНаДону' => 'бочку в Ростове На Дону',
	'бочкувРязани' => 'бочку в Рязани',
	'бочкувСамаре' => 'бочку в Самаре',
	'бочкувСанктПетербурге' => 'бочку в Санкт Петербурге',
	'бочкувСаратове' => 'бочку в Саратове',
	'бочкувСПБ' => 'бочку в СПБ',
	'бочкувТвери' => 'бочку в Твери',
	'бочкувТольятти' => 'бочку в Тольятти',
	'бочкувТуапсе' => 'бочку в Туапсе',
	'бочкувТуле' => 'бочку в Туле',
	'бочкувТюмени' => 'бочку в Тюмени',
	'бочкувУфе' => 'бочку в Уфе',
	'бочкувЧелябинске' => 'бочку в Челябинске',
	'бочкувЯрославле' => 'бочку в Ярославле',
	'бочкудляалкоголя' => 'бочку для алкоголя',
	'бочкудлявина' => 'бочку для вина',
	'бочкудлявинавМоскве' => 'бочку для вина в Москве',
	'бочкудлявинаиконьяка' => 'бочку для вина и коньяка',
	'бочкудлявиски' => 'бочку для виски',
	'бочкудляконьяка' => 'бочку для коньяка',
	'бочкудляконьякавМоскве' => 'бочку для коньяка в Москве',
	'бочкудляналивок' => 'бочку для наливок',
	'бочкудлянапитков' => 'бочку для напитков',
	'бочкудлянастоек' => 'бочку для настоек',
	'бочкудлясамогона' => 'бочку для самогона',
	'бочкудлясамогонавМоскве' => 'бочку для самогона в Москве',
	'бочкукадушку' => 'бочку кадушку',
	'бочкуна10литров' => 'бочку на 10 литров',
	'бочкуна15литров' => 'бочку на 15 литров',
	'бочкуна20литров' => 'бочку на 20 литров',
	'бочкуна200литров' => 'бочку на 200 литров',
	'бочкуна3литра' => 'бочку на 3 литра',
	'бочкуна30литров' => 'бочку на 30 литров',
	'бочкуна5литров' => 'бочку на 5 литров',
	'бочкуна50литров' => 'бочку на 50 литров',
	'бочкуназаказ' => 'бочку на заказ',
	'бочкуотпроизводителя' => 'бочку от производителя',
	'бочкуотпроизводителявСПБ' => 'бочку от производителя в СПБ',
	'бочкуподалкоголь' => 'бочку под алкоголь',
	'бочкуподвино' => 'бочку под вино',
	'бочкуподстарину' => 'бочку под старину',
	'бочкуручнойработы' => 'бочку ручной работы',
	'бочкуручнойсборки' => 'бочку ручной сборки',
	'бочкусгравировкой' => 'бочку с гравировкой',
	'бочкусизображением' => 'бочку с изображением',
	'бочкускраном' => 'бочку с краном',
	'бочкусмаркировкой' => 'бочку с маркировкой',
	'бочкуснадписью' => 'бочку с надписью',
	'бочкуснанесением' => 'бочку с нанесением',
	'бочкусобжигом' => 'бочку с обжигом',
	'бочкусрезьбой' => 'бочку с резьбой',
	'бочкусрисунком' => 'бочку с рисунком',
	'бочонок' => 'бочонок',
	'бочоноквМоскве' => 'бочонок в Москве',
	'бочоноквподарок' => 'бочонок в подарок',
	'бочоноквСПБ' => 'бочонок в СПБ',
	'бочонокдляалкоголя' => 'бочонок для алкоголя',
	'бочонокдлявина' => 'бочонок для вина',
	'бочонокдлявиски' => 'бочонок для виски',
	'бочонокдляконьяка' => 'бочонок для коньяка ',
	'бочонокдлянапитков' => 'бочонок для напитков',
	'бочонокдлянастоек' => 'бочонок для настоек',
	'бочонокдлясамогона' => 'бочонок для самогона',
	'бочонокиздерева' => 'бочонок из дерева',
	'бочонокиздуба' => 'бочонок из дуба',
	'бочонокна10литров' => 'бочонок на 10 литров',
	'бочонокна3литра' => 'бочонок на 3 литра',
	'бочонокна5литров' => 'бочонок на 5 литров',
	'бочонокназаказ' => 'бочонок на заказ',
	'бочонокподвино' => 'бочонок под вино',
	'бочонокподарочный' => 'бочонок подарочный',
	'бочоноксгравировкой' => 'бочонок с гравировкой',
	'бочоноксизображением' => 'бочонок с изображением',
	'бочонокснадписью' => 'бочонок с надписью',
	'бочоноксрезьбой' => 'бочонок с резьбой',
	'виннуюбочку' => 'винную бочку',
	'вощёнуюбочку' => 'вощёную бочку',
	'колотуюбочку' => 'колотую бочку',
	'Краснодарскуюбочку' => 'Краснодарскую бочку',
	'недорогуюбочку' => 'недорогую бочку',
	'недорогуюбочкувМоскве' => 'недорогую бочку в Москве',
	'недорогуюбочкудлясамогона' => 'недорогую бочку для самогона',
	'новуюбочку' => 'новую бочку',
	'подарочнуюбочку' => 'подарочную бочку',
	);


	function changeTitle()
	{
		global $cpc_titles;
		if( isset($_GET['podstanovkatema']) && array_key_exists(trim($_GET['podstanovkatema']),$cpc_titles) )
			return $cpc_titles[trim($_GET['podstanovkatema'])];
		elseif ( isset($_GET['podstanovkatema']) && array_key_exists(trim(iconv('cp1251','utf-8',$_GET['podstanovkatema'])),$cpc_titles) )	
			return $cpc_titles[trim(iconv('cp1251','utf-8',$_GET['podstanovkatema']))];
		else
			return 'images/back_header.jpg';
	}

	function changeName()
	{
		global $cpc_names;
		if( isset($_GET['podstanovkaterm']) && array_key_exists(trim($_GET['podstanovkaterm']),$cpc_names) )
			return $cpc_names[trim($_GET['podstanovkaterm'])];
		elseif ( isset($_GET['podstanovkaterm']) && array_key_exists(trim(iconv('cp1251','utf-8',$_GET['podstanovkaterm'])),$cpc_names) )	
			return $cpc_names[trim(iconv('cp1251','utf-8',$_GET['podstanovkaterm']))];
		else
			return '<div>бочонок</div>';
	}



	
	
?>